In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'
dados=pd.read_csv(url,sep=',')

In [2]:
dados.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [3]:
dados.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [4]:
dados.shape

(18, 4)

In [5]:
dados.info()
dados[['Nome','Idade','Notas']]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 582.0+ bytes

         Nome  Idade  Notas
0         Ary     20    7.5
1         Ana     18    NaN
2       Cátia     27    2.5
3       Denis     18    5.0
4        Beto     21   10.0
5       Bruna     23    NaN
6        Dara     21    7.0
7      Carlos     19    6.0
8       Alice     35    5.6
9       Vitor     28    NaN
10     Daniel     21    NaN
11       Igor     24    4.5
12  Sthefanie     26    9.5
13      Mirla     25    9.0
14      Paulo     37    NaN
15     Mylena     29    7.0
16      Lucas     33    NaN
17      Nadia     34    8.0

In [6]:
dados.isnull().sum()
dados = dados.fillna(0)

In [7]:
dados.isnull().sum()

Nome        0
Idade       0
Notas       0
Aprovado    0
dtype: int64

In [8]:
alunos_remover = dados.query('Nome == "Alice" | Nome == "Carlos"').index
dados.drop(alunos_remover, axis= 0, inplace= True)

In [9]:
selecao = dados['Aprovado'] == True

In [10]:
dados[selecao]

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    7.0      True
17      Nadia     34    8.0      True

In [11]:
alunos_aprovados = dados[selecao]
alunos_aprovados.to_csv('alunos_aprovados.csv', index=False)

In [12]:
alunos_aprovados.replace(7.0,8.0)

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    8.0      True
17      Nadia     34    8.0      True

In [13]:
dados['Pontos_Extras'] = dados['Notas'] * 0.4
dados.head()

    Nome  Idade  Notas  Aprovado  Pontos_Extras
0    Ary     20    7.5      True            3.0
1    Ana     18    0.0     False            0.0
2  Cátia     27    2.5     False            1.0
3  Denis     18    5.0     False            2.0
4   Beto     21   10.0      True            4.0

In [17]:
dados['Notas_finais'] = dados['Notas'] + dados['Pontos_Extras']
dados.head()

    Nome  Idade  Notas  Aprovado  Pontos_Extras  Notas_finais
0    Ary     20    7.5      True            3.0          10.5
1    Ana     18    0.0     False            0.0           0.0
2  Cátia     27    2.5     False            1.0           3.5
3  Denis     18    5.0     False            2.0           7.0
4   Beto     21   10.0      True            4.0          14.0

In [21]:
dados['Aprovado_final']= dados['Notas_finais'].apply(lambda x: True if x >= 6 else False)
dados.query('Aprovado == False & Aprovado_final == True')

     Nome  Idade  Notas  Aprovado  Pontos_Extras  Notas_finais  Aprovado_final
3   Denis     18    5.0     False            2.0           7.0            True
11   Igor     24    4.5     False            1.8           6.3            True